from random import *
i = 1
while i > 0:
   y = 1000
   print ("Ваш баланц ", y)
   while y > 0:
      a,d = map(int,input("Поставьте ставку и число на которое ставите от 0 до 99. Забрать выйгрыш - 0 100. \n").split(" "))
      chi = randint(0,99)
      if a > y or a < 0:
          print("Неподходящая ставкаю")
      elif a == 0 and d == 100:
         y = 0
      else:
         h = d % 2
         g = chi % 2
         if chi <= 5:
            print("Выпало зелёное", chi)
         elif g == 0:
            print("Выпало чёрное", chi)
         else:
            print("Выпало красное", chi)
         if chi == d:
            y = y + (a * 4)
            print("Ваша ставка умножена в 5 раз! Теперь у вас:", y)
         elif 6 > chi and 6 > d:
            y = y + (a * 3)
            print("Ваша ставка умножена в 4 раза! Теперь у вас:", y)
         elif h == g and d > 5:
            y = y + a
            print("Ваша ставка умножена в 2 раза! Теперь у вас:", y)
         else:
            y = y - a
            print("Вы проиграли, теперь у вас:", y)
         print("================================================================================")
   b = int(input("Хотите начать заново. да-1 нет-2 \n"))
   if b == 2:
      i = 0
   print("================================================================================")
print("Спасибо за игру, пока.")
