print("Камень ножницы бумага.")
from random import *
b = "0"
while b != "закончить":
   b = input("Введите камень, ножницы, бумага или закончить. \n")
   if b not in ( "камень","ножницы","бумага","закончить"):
      print("Вы написали что-то не то.")
   elif b in ("камень","ножницы","бумага"):
      a = randint(1,3)
      if a == 1:
         i = "камень"
      elif a == 2:
         i = "ножницы"
      else:
         i = "бумага"
      print(i)
      if b == i:
         print("Ничья")
      elif b == "ножницы" and i == "камень":
         print("Вы проиграли!")
      elif b == "ножницы" and i == "бумага":
         print("Вы выйграли!")
      elif b == "камень" and i == "бумага":
         print("Вы проиграли!")
      elif b == "камень" and i == "ножницы":
         print("Вы выйграли!")
      elif b == "бумага" and i == "ножницы":
         print("Вы проиграли!")
      else:
         print("Вы выйграли!")
   else:
      print("Спасибо за игру, досвидания.")
